In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [4]:
ser1 = Series(np.arange(3), index=['A','B','C'])

ser1 = 2 * ser1

ser1

A    0
B    2
C    4
dtype: int64

In [5]:
ser1['B']

2

In [6]:
ser1[1]

2

In [7]:
ser1[0:3]

A    0
B    2
C    4
dtype: int64

In [8]:
ser1[['A','B']]

A    0
B    2
dtype: int64

In [9]:
ser1[ser1 > 3]

C    4
dtype: int64

In [10]:
ser1[ser1 > 3] = 10

In [11]:
ser1

A     0
B     2
C    10
dtype: int64

In [12]:
dframe = DataFrame(np.arange(25).reshape((5,5)), index=['NY','LA','SF','DC','Chicago'],
                  columns=['A','B','C','D','E'])

In [13]:
dframe

          A   B   C   D   E
NY        0   1   2   3   4
LA        5   6   7   8   9
SF       10  11  12  13  14
DC       15  16  17  18  19
Chicago  20  21  22  23  24

In [14]:
dframe['B']

NY          1
LA          6
SF         11
DC         16
Chicago    21
Name: B, dtype: int64

In [15]:
dframe[['B','E']]

          B   E
NY        1   4
LA        6   9
SF       11  14
DC       16  19
Chicago  21  24

In [16]:
dframe[dframe['C'] > 8]

          A   B   C   D   E
SF       10  11  12  13  14
DC       15  16  17  18  19
Chicago  20  21  22  23  24

In [17]:
dframe

          A   B   C   D   E
NY        0   1   2   3   4
LA        5   6   7   8   9
SF       10  11  12  13  14
DC       15  16  17  18  19
Chicago  20  21  22  23  24

In [18]:
dframe > 10

             A      B      C      D      E
NY       False  False  False  False  False
LA       False  False  False  False  False
SF       False   True   True   True   True
DC        True   True   True   True   True
Chicago   True   True   True   True   True

In [19]:
dframe.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [20]:
dframe.ix[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [21]:
dframe.iloc[1,3]

8

In [22]:
dframe

          A   B   C   D   E
NY        0   1   2   3   4
LA        5   6   7   8   9
SF       10  11  12  13  14
DC       15  16  17  18  19
Chicago  20  21  22  23  24

In [26]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [27]:
dframe.iloc[1,3]

8

In [30]:
dframe['A']

NY          0
LA          5
SF         10
DC         15
Chicago    20
Name: A, dtype: int64

In [32]:
dframe.iloc[1]

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64

In [35]:
dframe.ix['LA']

A    5
B    6
C    7
D    8
E    9
Name: LA, dtype: int64